import React from 'react';

export default function About() {
  return (
    <section className="about-us">
      <h2>О ШВЕЙНОМ ПРОИЗВОДСТВЕ LEETME PRODUCTION</h2>
      <p>
        Производство Leetme Production основано в 2021 году Юлией Копчиковой.
      </p>
      <p>
        С самого первого дня мы специализировались на локальных брендах и
        небольших объемах, что позволяет нам выполнять запуск коллекций,
        соблюдая все критерии качества для сегмента мидл-ап и премиум.
      </p>
      <p>
        Мы берем на себя полный производственный цикл и готовим коллекции для
        запуска в тираж.
      </p>
      <p>
        Мы специализируемся на работе со сторонними заказами, с изделиями
        различной сложности, от единичного запуска до мелкого опта.Наше
        производство осуществляет пошив одежды на заказ не только в Москве, но и
        удаленно с другими городами и странами.
      </p>
      <p>
        В команде Leetme Production каждый сотрудник работает на результат,
        который помогает росту предприятия. Мы позиционируем себя как
        производство высокого качества и делаем все, чтобы этому
        соответствовать. Только командная работа позволяет это осуществить.
      </p>
    </section>
  );
}
