import React from 'react';
import { Link } from 'react-router-dom';

import Logo from '../../assets/logo3.jpg';
import CustomList from '../customList/CustomList';

const paragraphs = [
  {
    id: 1,
    paragraph: (
      <>
        <p>
          Привет! Мы швейное производство LEETME Production. Наша деятельность
          началась в 2021 году. За это время нам удалось привлечь более 400
          клиентов, 40% из которых возвращаются к нам 2 и более раз. Мы работаем
          с крупными торговыми марками, с брендами в премиум сегменте и
          локальными производителями. Мы хорошо зарекомендовали себя на рынке и
          имеем постоянную загрузку, вне зависимости от сезона.
        </p>
        <br />
        <p>
          На данный момент мы находимся на стадии реорганизации из контрактного
          производства под собственную торговую марку. В наших планах оставить
          30% загрузки под сторонние заказы и 70% под СТМ.
        </p>
        <br />
        <p>
          Наша цель занять уверенную позицию на fashion рынке в сегменте middle
          up и премиум.
        </p>
        <br />
        <p>
          Наш ключевой приоритет в любом направлении – качество, и мы искренне
          верим, что оно должно оставаться высоким, независимо от обстоятельств.
          Именно за этим к нам и приходят клиенты.
        </p>
        <br />
        <p>
          Если вы разделяете наши ценности и подход в работе и готовы стать
          частью команды LEETME Pro - присылайте свое резюме и сопроводительное
          письмо на почту hr.leetme@mail.ru с пометкой название вакансии в теме
          письма.
        </p>
      </>
    ),
  },
];
const vacanciesList = [
  {
    id: 1,
    h3: 'Швея',
    paragraph: (
      <>
        <p>
          Опыт работы: рассматриваем кандидатов с разным опытом работы и с
          начальными навыками
        </p>
        <br />
        <p>Специализация:</p>
        <p>- трикотаж 80% ассортимента</p>
        <p>- текстиль 20% ассортимента</p>
        <br />
        <h5>ПОСТОЯННАЯ ЗАГРУЗКА БОЛЬШИМ ОБЪЕМОМ РАБОТЫ</h5>
        <p>Пошив пооперационный в бригадах от 2-х человек до 10.</p>
        <p>Есть загрузка на пошив индивидуальный "от и до".</p>
        <br />
        <p>МЫ ПРЕДЛАГАЕМ:</p>
        <p>- сдельно-премиальную заработную плату, выплаты два раза в месяц;</p>
        <p>- помощь в работе технолога и мастера цеха;</p>
        <p>- график работы 5/2, 2/2, 3/3, 6/1;</p>
        <p>- возможность работать по выходным (подработка);</p>
        <p>
          - чистое, светлое помещение с большими окнами, кондиционерами,
          регулярной уборкой, отдельной зоной кухни и отдыха (микроволновка,
          холодильник и вода в свободном доступе);
        </p>
        <p>
          - пешая доступность от метро Дмитровская (7 минут пешком), автобусная
          остановка возле БЦ, МЦД и МЦК;
        </p>
        <p>- испытательный срок 1 месяц с полной оплатой труда;</p>
        <p>- оформление по ТК РФ.</p>
        <br />
        <p>ВАШИ ОБЯЗАННОСТИ:</p>
        <p>
          - Качественное изготовление изделий - прямые строчки, точность сборки;
        </p>
        <p>- Работа с готовым кроем БЕЗ ВТО.</p>
        <br />
        <p>ТРЕБОВАНИЯ:</p>
        <p>- Бережное отношение к качеству выпускаемой продукции;</p>
        <p>- Внимательность к деталям, аккуратность, ответственность.</p>
      </>
    ),
  },
  {
    id: 2,
    h3: 'Швея-Лаборант',
    paragraph: (
      <>
        <p>Опыт работы: от 3-х лет</p>
        <br />
        <h5>
          Преимуществом является опыт работы в ателье, индивидуальном пошиве,
          экспериментальном цехе или на производстве.:
        </h5>
        <br />
        <h4>ВАШИ ОБЯЗАННОСТИ:</h4>
        <p>
          - отработка новых моделей совместно с технологом/мастером и
          конструктором;
        </p>
        <p>- фиксация ошибок конструкции.</p>
        <br />
        <h4>ТРЕБОВАНИЯ:</h4>
        <p>- знание технологий пошива изделия;</p>
        <p>- знание промышленного оборудования;</p>
        <p>- высокие стандарты качества;</p>
        <p>- личные качества: трудолюбие, внимательность, ответственность.</p>
        <br />
        <h4>МЫ ПРЕДЛАГАЕМ:</h4>
        <span>- сдельную заработную плату, выплаты два раза в месяц;</span>
        <p>- помощь в работе технолога и мастера цеха;</p>
        <p>- график работы 5/2, 2/2, 3/3, 6/1;</p>
        <p>- возможность работать по выходным (подработка);</p>
        <span>
          - чистое, светлое помещение с большими окнами, кондиционерами,
          регулярной уборкой, отдельной зоной кухни и отдыха (микроволновка,
          холодильник и вода в свободном доступе);
        </span>
        <p>
          - пешая доступность от метро Дмитровская (7 минут пешком), автобусная
          остановка возле БЦ, МЦД и МЦК;
        </p>
        <p>- испытательный срок 1 месяц с полной оплатой труда;</p>
        <p>- оформление по ТК РФ.</p>
        <br />
        <h5>Выход на работу на следующий день после тестирования.</h5>
      </>
    ),
  },
];

export default function Vacancies() {
  const [burgerActive, setBurgerActive] = React.useState(false);
  const openBurger = () => setBurgerActive(true);
  const closeBurger = () => setBurgerActive(false);
  return (
    <>
      {' '}
      <section id="vacancies">
        <div className="vacancies_burger-menu">
          <div>
            {!burgerActive ? (
              <div className="vacancies_burger-menu-logo">
                <div className="vacancies_burger-menu-logo-parent">
                  <div>
                    <h2>AJUR</h2>
                  </div>
                  <svg
                    onClick={openBurger}
                    width="40"
                    height="40"
                    viewBox="0 0 32 32"
                    fill="none"
                    xmlns="http://www.w3.org/2000/svg"
                  >
                    <path
                      d="M4 8H28M4 16H28M4 24H28"
                      stroke="black"
                      stroke-width="2"
                      stroke-linecap="round"
                      stroke-linejoin="round"
                    />
                  </svg>
                </div>
              </div>
            ) : (
              <svg
                className="close"
                onClick={closeBurger}
                width="40"
                height="40"
                viewBox="0 0 24 24"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
              >
                <path
                  d="M6.4 19L5 17.6L10.6 12L5 6.4L6.4 5L12 10.6L17.6 5L19 6.4L13.4 12L19 17.6L17.6 19L12 13.4L6.4 19Z"
                  fill="#000"
                />
              </svg>
            )}
          </div>
        </div>
        {burgerActive && (
          <section className="vacancies_burger-menu">
            <div className="vacancies_burger-menu-logo">
              <img src={Logo} alt="logo" />
            </div>
            <section className="vacancies_burger-menu-navigation">
              <nav>
                <Link to={'/'}>Главная</Link>
                <a href="#contacts">Контакты</a>
              </nav>
            </section>
            <section className="vacancies_burger-menu__social-links">
              <p>Современное швейное производство</p>
              <nav>
                <a href="https://t.me/ruslan001n">
                  <svg
                    width="28"
                    height="28"
                    viewBox="0 0 24 24"
                    fill="none"
                    xmlns="http://www.w3.org/2000/svg"
                  >
                    <path
                      d="M12 2C6.48 2 2 6.48 2 12C2 17.52 6.48 22 12 22C17.52 22 22 17.52 22 12C22 6.48 17.52 2 12 2ZM16.64 8.8C16.49 10.38 15.84 14.22 15.51 15.99C15.37 16.74 15.09 16.99 14.83 17.02C14.25 17.07 13.81 16.64 13.25 16.27C12.37 15.69 11.87 15.33 11.02 14.77C10.03 14.12 10.67 13.76 11.24 13.18C11.39 13.03 13.95 10.7 14 10.49C14.0069 10.4582 14.006 10.4252 13.9973 10.3938C13.9886 10.3624 13.9724 10.3337 13.95 10.31C13.89 10.26 13.81 10.28 13.74 10.29C13.65 10.31 12.25 11.24 9.52 13.08C9.12 13.35 8.76 13.49 8.44 13.48C8.08 13.47 7.4 13.28 6.89 13.11C6.26 12.91 5.77 12.8 5.81 12.45C5.83 12.27 6.08 12.09 6.55 11.9C9.47 10.63 11.41 9.79 12.38 9.39C15.16 8.23 15.73 8.03 16.11 8.03C16.19 8.03 16.38 8.05 16.5 8.15C16.6 8.23 16.63 8.34 16.64 8.42C16.63 8.48 16.65 8.66 16.64 8.8Z"
                      fill="#222222"
                    />
                  </svg>
                </a>
                <a href="https://www.instagram.com/ajur_production/">
                  <svg
                    width="28"
                    height="28"
                    viewBox="0 0 24 24"
                    fill="none"
                    xmlns="http://www.w3.org/2000/svg"
                  >
                    <path
                      d="M7.8 2H16.2C19.4 2 22 4.6 22 7.8V16.2C22 17.7383 21.3889 19.2135 20.3012 20.3012C19.2135 21.3889 17.7383 22 16.2 22H7.8C4.6 22 2 19.4 2 16.2V7.8C2 6.26174 2.61107 4.78649 3.69878 3.69878C4.78649 2.61107 6.26174 2 7.8 2ZM7.6 4C6.64522 4 5.72955 4.37928 5.05442 5.05442C4.37928 5.72955 4 6.64522 4 7.6V16.4C4 18.39 5.61 20 7.6 20H16.4C17.3548 20 18.2705 19.6207 18.9456 18.9456C19.6207 18.2705 20 17.3548 20 16.4V7.6C20 5.61 18.39 4 16.4 4H7.6ZM17.25 5.5C17.5815 5.5 17.8995 5.6317 18.1339 5.86612C18.3683 6.10054 18.5 6.41848 18.5 6.75C18.5 7.08152 18.3683 7.39946 18.1339 7.63388C17.8995 7.8683 17.5815 8 17.25 8C16.9185 8 16.6005 7.8683 16.3661 7.63388C16.1317 7.39946 16 7.08152 16 6.75C16 6.41848 16.1317 6.10054 16.3661 5.86612C16.6005 5.6317 16.9185 5.5 17.25 5.5ZM12 7C13.3261 7 14.5979 7.52678 15.5355 8.46447C16.4732 9.40215 17 10.6739 17 12C17 13.3261 16.4732 14.5979 15.5355 15.5355C14.5979 16.4732 13.3261 17 12 17C10.6739 17 9.40215 16.4732 8.46447 15.5355C7.52678 14.5979 7 13.3261 7 12C7 10.6739 7.52678 9.40215 8.46447 8.46447C9.40215 7.52678 10.6739 7 12 7ZM12 9C11.2044 9 10.4413 9.31607 9.87868 9.87868C9.31607 10.4413 9 11.2044 9 12C9 12.7956 9.31607 13.5587 9.87868 14.1213C10.4413 14.6839 11.2044 15 12 15C12.7956 15 13.5587 14.6839 14.1213 14.1213C14.6839 13.5587 15 12.7956 15 12C15 11.2044 14.6839 10.4413 14.1213 9.87868C13.5587 9.31607 12.7956 9 12 9Z"
                      fill="#222222"
                    />
                  </svg>
                </a>
                <a href="https://wa.me/79684776242">
                  <svg
                    width="28"
                    height="28"
                    viewBox="0 0 24 24"
                    fill="none"
                    xmlns="http://www.w3.org/2000/svg"
                  >
                    <path
                      d="M19.05 4.91006C18.1332 3.98399 17.0412 3.24973 15.8377 2.75011C14.6341 2.25049 13.3432 1.99552 12.04 2.00006C6.58005 2.00006 2.13005 6.45006 2.13005 11.9101C2.13005 13.6601 2.59005 15.3601 3.45005 16.8601L2.05005 22.0001L7.30005 20.6201C8.75005 21.4101 10.38 21.8301 12.04 21.8301C17.5 21.8301 21.9501 17.3801 21.9501 11.9201C21.9501 9.27006 20.92 6.78006 19.05 4.91006ZM12.04 20.1501C10.56 20.1501 9.11005 19.7501 7.84005 19.0001L7.54005 18.8201L4.42005 19.6401L5.25005 16.6001L5.05005 16.2901C4.2278 14.977 3.79119 13.4593 3.79005 11.9101C3.79005 7.37006 7.49005 3.67006 12.03 3.67006C14.23 3.67006 16.3 4.53006 17.85 6.09006C18.6175 6.85402 19.2257 7.76272 19.6394 8.76348C20.0531 9.76425 20.2641 10.8372 20.26 11.9201C20.28 16.4601 16.58 20.1501 12.04 20.1501ZM16.56 13.9901C16.31 13.8701 15.09 13.2701 14.87 13.1801C14.64 13.1001 14.48 13.0601 14.31 13.3001C14.14 13.5501 13.67 14.1101 13.53 14.2701C13.39 14.4401 13.24 14.4601 12.99 14.3301C12.74 14.2101 11.94 13.9401 11 13.1001C10.26 12.4401 9.77005 11.6301 9.62005 11.3801C9.48005 11.1301 9.60005 11.0001 9.73005 10.8701C9.84005 10.7601 9.98005 10.5801 10.1 10.4401C10.22 10.3001 10.27 10.1901 10.35 10.0301C10.43 9.86006 10.39 9.72006 10.33 9.60006C10.27 9.48006 9.77005 8.26006 9.57005 7.76006C9.37005 7.28006 9.16005 7.34006 9.01005 7.33006H8.53005C8.36005 7.33006 8.10005 7.39006 7.87005 7.64006C7.65005 7.89006 7.01005 8.49006 7.01005 9.71006C7.01005 10.9301 7.90005 12.1101 8.02005 12.2701C8.14005 12.4401 9.77005 14.9401 12.25 16.0101C12.84 16.2701 13.3 16.4201 13.66 16.5301C14.25 16.7201 14.79 16.6901 15.22 16.6301C15.7 16.5601 16.69 16.0301 16.89 15.4501C17.1 14.8701 17.1 14.3801 17.03 14.2701C16.96 14.1601 16.81 14.1101 16.56 13.9901Z"
                      fill="#222222"
                    />
                  </svg>
                </a>
              </nav>
            </section>
            <section className="vacancies_burger-menu__add-application">
              <div>
                <p>+79250093540</p>
                <p>LEETME.PRO@MAIL.RU</p>
                <p>МОСКВА, М. ДМИТРОВСКАЯ</p>
                <p>УЛ. НОВОДМИТРОВСКАЯ, 5А/2</p>
              </div>
              <div>
                <button>
                  <a href="https://t.me/ruslan001n">Оставить заявку</a>
                </button>
              </div>
            </section>
          </section>
        )}
        <section className="vacancies_info">
          <section className="vacancies_social-links">
            <p>Современное швейное производство</p>
            <nav>
              <a href="https://t.me/ruslan001n">
                <svg
                  width="24"
                  height="24"
                  viewBox="0 0 24 24"
                  fill="none"
                  xmlns="http://www.w3.org/2000/svg"
                >
                  <path
                    d="M12 2C6.48 2 2 6.48 2 12C2 17.52 6.48 22 12 22C17.52 22 22 17.52 22 12C22 6.48 17.52 2 12 2ZM16.64 8.8C16.49 10.38 15.84 14.22 15.51 15.99C15.37 16.74 15.09 16.99 14.83 17.02C14.25 17.07 13.81 16.64 13.25 16.27C12.37 15.69 11.87 15.33 11.02 14.77C10.03 14.12 10.67 13.76 11.24 13.18C11.39 13.03 13.95 10.7 14 10.49C14.0069 10.4582 14.006 10.4252 13.9973 10.3938C13.9886 10.3624 13.9724 10.3337 13.95 10.31C13.89 10.26 13.81 10.28 13.74 10.29C13.65 10.31 12.25 11.24 9.52 13.08C9.12 13.35 8.76 13.49 8.44 13.48C8.08 13.47 7.4 13.28 6.89 13.11C6.26 12.91 5.77 12.8 5.81 12.45C5.83 12.27 6.08 12.09 6.55 11.9C9.47 10.63 11.41 9.79 12.38 9.39C15.16 8.23 15.73 8.03 16.11 8.03C16.19 8.03 16.38 8.05 16.5 8.15C16.6 8.23 16.63 8.34 16.64 8.42C16.63 8.48 16.65 8.66 16.64 8.8Z"
                    fill="#222222"
                  />
                </svg>
              </a>
              <a href="https://www.instagram.com/ajur_production/">
                <svg
                  width="24"
                  height="24"
                  viewBox="0 0 24 24"
                  fill="none"
                  xmlns="http://www.w3.org/2000/svg"
                >
                  <path
                    d="M7.8 2H16.2C19.4 2 22 4.6 22 7.8V16.2C22 17.7383 21.3889 19.2135 20.3012 20.3012C19.2135 21.3889 17.7383 22 16.2 22H7.8C4.6 22 2 19.4 2 16.2V7.8C2 6.26174 2.61107 4.78649 3.69878 3.69878C4.78649 2.61107 6.26174 2 7.8 2ZM7.6 4C6.64522 4 5.72955 4.37928 5.05442 5.05442C4.37928 5.72955 4 6.64522 4 7.6V16.4C4 18.39 5.61 20 7.6 20H16.4C17.3548 20 18.2705 19.6207 18.9456 18.9456C19.6207 18.2705 20 17.3548 20 16.4V7.6C20 5.61 18.39 4 16.4 4H7.6ZM17.25 5.5C17.5815 5.5 17.8995 5.6317 18.1339 5.86612C18.3683 6.10054 18.5 6.41848 18.5 6.75C18.5 7.08152 18.3683 7.39946 18.1339 7.63388C17.8995 7.8683 17.5815 8 17.25 8C16.9185 8 16.6005 7.8683 16.3661 7.63388C16.1317 7.39946 16 7.08152 16 6.75C16 6.41848 16.1317 6.10054 16.3661 5.86612C16.6005 5.6317 16.9185 5.5 17.25 5.5ZM12 7C13.3261 7 14.5979 7.52678 15.5355 8.46447C16.4732 9.40215 17 10.6739 17 12C17 13.3261 16.4732 14.5979 15.5355 15.5355C14.5979 16.4732 13.3261 17 12 17C10.6739 17 9.40215 16.4732 8.46447 15.5355C7.52678 14.5979 7 13.3261 7 12C7 10.6739 7.52678 9.40215 8.46447 8.46447C9.40215 7.52678 10.6739 7 12 7ZM12 9C11.2044 9 10.4413 9.31607 9.87868 9.87868C9.31607 10.4413 9 11.2044 9 12C9 12.7956 9.31607 13.5587 9.87868 14.1213C10.4413 14.6839 11.2044 15 12 15C12.7956 15 13.5587 14.6839 14.1213 14.1213C14.6839 13.5587 15 12.7956 15 12C15 11.2044 14.6839 10.4413 14.1213 9.87868C13.5587 9.31607 12.7956 9 12 9Z"
                    fill="#222222"
                  />
                </svg>
              </a>
              <a href="https://wa.me/79684776242">
                <svg
                  width="24"
                  height="24"
                  viewBox="0 0 24 24"
                  fill="none"
                  xmlns="http://www.w3.org/2000/svg"
                >
                  <path
                    d="M19.05 4.91006C18.1332 3.98399 17.0412 3.24973 15.8377 2.75011C14.6341 2.25049 13.3432 1.99552 12.04 2.00006C6.58005 2.00006 2.13005 6.45006 2.13005 11.9101C2.13005 13.6601 2.59005 15.3601 3.45005 16.8601L2.05005 22.0001L7.30005 20.6201C8.75005 21.4101 10.38 21.8301 12.04 21.8301C17.5 21.8301 21.9501 17.3801 21.9501 11.9201C21.9501 9.27006 20.92 6.78006 19.05 4.91006ZM12.04 20.1501C10.56 20.1501 9.11005 19.7501 7.84005 19.0001L7.54005 18.8201L4.42005 19.6401L5.25005 16.6001L5.05005 16.2901C4.2278 14.977 3.79119 13.4593 3.79005 11.9101C3.79005 7.37006 7.49005 3.67006 12.03 3.67006C14.23 3.67006 16.3 4.53006 17.85 6.09006C18.6175 6.85402 19.2257 7.76272 19.6394 8.76348C20.0531 9.76425 20.2641 10.8372 20.26 11.9201C20.28 16.4601 16.58 20.1501 12.04 20.1501ZM16.56 13.9901C16.31 13.8701 15.09 13.2701 14.87 13.1801C14.64 13.1001 14.48 13.0601 14.31 13.3001C14.14 13.5501 13.67 14.1101 13.53 14.2701C13.39 14.4401 13.24 14.4601 12.99 14.3301C12.74 14.2101 11.94 13.9401 11 13.1001C10.26 12.4401 9.77005 11.6301 9.62005 11.3801C9.48005 11.1301 9.60005 11.0001 9.73005 10.8701C9.84005 10.7601 9.98005 10.5801 10.1 10.4401C10.22 10.3001 10.27 10.1901 10.35 10.0301C10.43 9.86006 10.39 9.72006 10.33 9.60006C10.27 9.48006 9.77005 8.26006 9.57005 7.76006C9.37005 7.28006 9.16005 7.34006 9.01005 7.33006H8.53005C8.36005 7.33006 8.10005 7.39006 7.87005 7.64006C7.65005 7.89006 7.01005 8.49006 7.01005 9.71006C7.01005 10.9301 7.90005 12.1101 8.02005 12.2701C8.14005 12.4401 9.77005 14.9401 12.25 16.0101C12.84 16.2701 13.3 16.4201 13.66 16.5301C14.25 16.7201 14.79 16.6901 15.22 16.6301C15.7 16.5601 16.69 16.0301 16.89 15.4501C17.1 14.8701 17.1 14.3801 17.03 14.2701C16.96 14.1601 16.81 14.1101 16.56 13.9901Z"
                    fill="#222222"
                  />
                </svg>
              </a>
            </nav>
          </section>
          <section className="vacancies_logo">
            <img src={Logo} alt="logo" />
          </section>
          <section className="vacancies_add-application">
            <div>
              <p>+79250093540</p>
              <p>LEETME.PRO@MAIL.RU</p>
              <p>МОСКВА, М. ДМИТРОВСКАЯ</p>
              <p>УЛ. НОВОДМИТРОВСКАЯ, 5А/2</p>
            </div>
            <div>
              <button>
                <a href="https://t.me/ruslan001n">Оставить заявку</a>
              </button>
            </div>
          </section>
        </section>
        <section className="vacancies_navigation">
          <nav>
            <Link to={'/'}>Главная</Link>
            <a href="#contacts">Контакты</a>
          </nav>
        </section>
      </section>
      <section className="vacancies_main">
        <div className="vacancies_main-head">
          <h2>Вакансии</h2>
          <p>швейного производства в Москве</p>
        </div>
        <div className="vacancies_main-title">
          {paragraphs.map((p) => (
            <div key={p.id}>{p.paragraph}</div>
          ))}
        </div>
        <div className="vacancies_main-list">
          {vacanciesList.map((vac) => (
            <CustomList key={vac.id} h3={vac.h3} paragraph={vac.paragraph} />
          ))}
        </div>
      </section>
      <div>
        <section id="contacts" className="footer-sewing nav">
          <nav>
            <div>
              {' '}
              <a href="https://t.me/ruslan001n">
                <svg
                  width="30"
                  height="30"
                  viewBox="0 0 24 24"
                  fill="none"
                  xmlns="http://www.w3.org/2000/svg"
                >
                  <path
                    d="M12 2C6.48 2 2 6.48 2 12C2 17.52 6.48 22 12 22C17.52 22 22 17.52 22 12C22 6.48 17.52 2 12 2ZM16.64 8.8C16.49 10.38 15.84 14.22 15.51 15.99C15.37 16.74 15.09 16.99 14.83 17.02C14.25 17.07 13.81 16.64 13.25 16.27C12.37 15.69 11.87 15.33 11.02 14.77C10.03 14.12 10.67 13.76 11.24 13.18C11.39 13.03 13.95 10.7 14 10.49C14.0069 10.4582 14.006 10.4252 13.9973 10.3938C13.9886 10.3624 13.9724 10.3337 13.95 10.31C13.89 10.26 13.81 10.28 13.74 10.29C13.65 10.31 12.25 11.24 9.52 13.08C9.12 13.35 8.76 13.49 8.44 13.48C8.08 13.47 7.4 13.28 6.89 13.11C6.26 12.91 5.77 12.8 5.81 12.45C5.83 12.27 6.08 12.09 6.55 11.9C9.47 10.63 11.41 9.79 12.38 9.39C15.16 8.23 15.73 8.03 16.11 8.03C16.19 8.03 16.38 8.05 16.5 8.15C16.6 8.23 16.63 8.34 16.64 8.42C16.63 8.48 16.65 8.66 16.64 8.8Z"
                    fill="#222222"
                  />
                </svg>
              </a>
              <a href="https://www.instagram.com/ajur_production/">
                <svg
                  width="30"
                  height="30"
                  viewBox="0 0 24 24"
                  fill="none"
                  xmlns="http://www.w3.org/2000/svg"
                >
                  <path
                    d="M7.8 2H16.2C19.4 2 22 4.6 22 7.8V16.2C22 17.7383 21.3889 19.2135 20.3012 20.3012C19.2135 21.3889 17.7383 22 16.2 22H7.8C4.6 22 2 19.4 2 16.2V7.8C2 6.26174 2.61107 4.78649 3.69878 3.69878C4.78649 2.61107 6.26174 2 7.8 2ZM7.6 4C6.64522 4 5.72955 4.37928 5.05442 5.05442C4.37928 5.72955 4 6.64522 4 7.6V16.4C4 18.39 5.61 20 7.6 20H16.4C17.3548 20 18.2705 19.6207 18.9456 18.9456C19.6207 18.2705 20 17.3548 20 16.4V7.6C20 5.61 18.39 4 16.4 4H7.6ZM17.25 5.5C17.5815 5.5 17.8995 5.6317 18.1339 5.86612C18.3683 6.10054 18.5 6.41848 18.5 6.75C18.5 7.08152 18.3683 7.39946 18.1339 7.63388C17.8995 7.8683 17.5815 8 17.25 8C16.9185 8 16.6005 7.8683 16.3661 7.63388C16.1317 7.39946 16 7.08152 16 6.75C16 6.41848 16.1317 6.10054 16.3661 5.86612C16.6005 5.6317 16.9185 5.5 17.25 5.5ZM12 7C13.3261 7 14.5979 7.52678 15.5355 8.46447C16.4732 9.40215 17 10.6739 17 12C17 13.3261 16.4732 14.5979 15.5355 15.5355C14.5979 16.4732 13.3261 17 12 17C10.6739 17 9.40215 16.4732 8.46447 15.5355C7.52678 14.5979 7 13.3261 7 12C7 10.6739 7.52678 9.40215 8.46447 8.46447C9.40215 7.52678 10.6739 7 12 7ZM12 9C11.2044 9 10.4413 9.31607 9.87868 9.87868C9.31607 10.4413 9 11.2044 9 12C9 12.7956 9.31607 13.5587 9.87868 14.1213C10.4413 14.6839 11.2044 15 12 15C12.7956 15 13.5587 14.6839 14.1213 14.1213C14.6839 13.5587 15 12.7956 15 12C15 11.2044 14.6839 10.4413 14.1213 9.87868C13.5587 9.31607 12.7956 9 12 9Z"
                    fill="#222222"
                  />
                </svg>
              </a>
              <a href="https://wa.me/79684776242">
                <svg
                  width="30"
                  height="30"
                  viewBox="0 0 24 24"
                  fill="none"
                  xmlns="http://www.w3.org/2000/svg"
                >
                  <path
                    d="M19.05 4.91006C18.1332 3.98399 17.0412 3.24973 15.8377 2.75011C14.6341 2.25049 13.3432 1.99552 12.04 2.00006C6.58005 2.00006 2.13005 6.45006 2.13005 11.9101C2.13005 13.6601 2.59005 15.3601 3.45005 16.8601L2.05005 22.0001L7.30005 20.6201C8.75005 21.4101 10.38 21.8301 12.04 21.8301C17.5 21.8301 21.9501 17.3801 21.9501 11.9201C21.9501 9.27006 20.92 6.78006 19.05 4.91006ZM12.04 20.1501C10.56 20.1501 9.11005 19.7501 7.84005 19.0001L7.54005 18.8201L4.42005 19.6401L5.25005 16.6001L5.05005 16.2901C4.2278 14.977 3.79119 13.4593 3.79005 11.9101C3.79005 7.37006 7.49005 3.67006 12.03 3.67006C14.23 3.67006 16.3 4.53006 17.85 6.09006C18.6175 6.85402 19.2257 7.76272 19.6394 8.76348C20.0531 9.76425 20.2641 10.8372 20.26 11.9201C20.28 16.4601 16.58 20.1501 12.04 20.1501ZM16.56 13.9901C16.31 13.8701 15.09 13.2701 14.87 13.1801C14.64 13.1001 14.48 13.0601 14.31 13.3001C14.14 13.5501 13.67 14.1101 13.53 14.2701C13.39 14.4401 13.24 14.4601 12.99 14.3301C12.74 14.2101 11.94 13.9401 11 13.1001C10.26 12.4401 9.77005 11.6301 9.62005 11.3801C9.48005 11.1301 9.60005 11.0001 9.73005 10.8701C9.84005 10.7601 9.98005 10.5801 10.1 10.4401C10.22 10.3001 10.27 10.1901 10.35 10.0301C10.43 9.86006 10.39 9.72006 10.33 9.60006C10.27 9.48006 9.77005 8.26006 9.57005 7.76006C9.37005 7.28006 9.16005 7.34006 9.01005 7.33006H8.53005C8.36005 7.33006 8.10005 7.39006 7.87005 7.64006C7.65005 7.89006 7.01005 8.49006 7.01005 9.71006C7.01005 10.9301 7.90005 12.1101 8.02005 12.2701C8.14005 12.4401 9.77005 14.9401 12.25 16.0101C12.84 16.2701 13.3 16.4201 13.66 16.5301C14.25 16.7201 14.79 16.6901 15.22 16.6301C15.7 16.5601 16.69 16.0301 16.89 15.4501C17.1 14.8701 17.1 14.3801 17.03 14.2701C16.96 14.1601 16.81 14.1101 16.56 13.9901Z"
                    fill="#222222"
                  />
                </svg>
              </a>
            </div>
            <div>
              <a href="tel:+79684776242">+7 968 477 6242</a>
              <a href="tel:+79772837530">+7 977 283 7530</a>
            </div>
          </nav>
        </section>
        <section className="footer">
          <div className="footer-items">
            <div>
              <p>© 2021-2023 LEETME Production</p>
            </div>
            <div>
              <p>Политика конфедициальности</p>
              <p>Договор-оферта</p>
            </div>
          </div>
        </section>
      </div>
    </>
  );
}
